{
    "projects" :
    [
        {
            "projectName" : "Recommendation System for Yelp Businesses",
            "technologies" : "Python, Spark, MapReduce",
            "duration" : "May 2020-June 2020",
            "description" : [
                "Devised content based recommendation algorithm which uses comprehensive reviews for each unique user and business to determine businesses likely to be reviewed by user.", 
                "Applied collaborative filtering methods to predict the ratings for about 10 thousand businesses by about 26 thousand unique users using specialized online and offline real-time algorithms with less than 1% RMS error on real world data."], 
            "link" : "https://github.com/anishvaidya/INF-553-Data-Mining"
        },
        {
            "projectName" : "Dialog Act Tagger for Sequence Labelling",
            "technologies" : "Python, PyCRF suite",
            "duration" : "February 2020-March 2020",
            "description" : [
                "Implemented a conditional random field model leveraging PyCRF suite for assigning dialog acts to data extracted from Switchboard DAMSL corpus and secured an accuracy of 74% on the baseline tagger.",
                "Improved accuracy of tagger by implementing an optimized  n-gram model approach to baseline tagger and achieved an accuracy of 80% on advanced tagger."],
            "link" : "https://github.com/anishvaidya/CSCI-544---Applied-Natural-Language-Processing"
        },
        {
            "projectName" : "Personal Digital Assistant for Alzheimer's Patients",
            "technologies" : "Android, Python, Firebase, Tensorflow, Keras",
            "duration" : "May 2018-April 2019",
            "description" : [
                "Directed the team to construct an Android application for Alzheimer's patients with features like daily reminders for medicine and meals and providing scene recognition using images captured from mobile device.",
                "Created scene recognition deep neural network model based on VGG-16 Convolutional Neural Network architecture along with  MIT's Indoor Scene Recognition dataset and deployed it on Android using Tensorflow Lite.",
                "Optimized the model leveraging methods like dropout and used stochastic gradient optimizer to acquire an accuracy of 76.4% on a test set with 60 classes.",
                "Paper published in Computing Methodology journal published by Elsevier BV and made Top - 10 list in topic dementia. Link - https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3266783"],
            "link" : "https://github.com/anishvaidya/MIT-Indoor-Scene-Recognition"
        },
        {
            "projectName" : "Face Recognition using One-Shot Learning",
            "technologies" : "Python, OpenCV, Tensorflow, Keras",
            "duration" : "June 2018 - November 2018",
            "description" : [
                "Implemented OpenCV model to detect faces in real time from the images captured through the computer's webcam.",
                "Utilized the FaceNet pre-trained architecture model to create 128 dimensional embeddings for each detected face.",
                "Constructed the triplet loss function in Python to compare facial embeddings and recognize faces in real time."
            ],
            "link" : "https://github.com/anishvaidya/Face-Recognition-Inception-Opencv-"            
        },
        {
            "projectName" : "Browser Torrent",
            "technologies" : "VueJS, Torrent API, Javascript",
            "duration" : "January 2018-March 2018",
            "description" : [
                "Developed a  web-application to download legal torrents directly through the browser without having to download any torrent client application.",
                "Leveraged the Torrent API to handle the protocol and download files in a plug-and-play fashion."
            ],
            "link" : "https://github.com/anishvaidya/Face-Recognition-Inception-Opencv-"            
        }
    ]
}